#define _CRT_SECURE_NO_WARNINGS   1

#include"Contact.h"

//菜单的实现
void menu()
{
	cout << " _________________________________________________________________ " << endl;
	cout << "|                                                                 |" << endl;
	cout << "| *************************************************************** |" << endl;
	cout << "| *************************************************************** |" << endl;
	cout << "| ***************     海内存知己，天涯若比邻  ******************* |" << endl;
	cout << "| **********  欢迎来到通讯录，现在可以联系你想念的人了 ********** |" << endl;
	cout << "| *************************************************************** |" << endl;
	cout << "| *************************************************************** |" << endl;
	cout << "| *************************************************************** |" << endl;
	cout << "| **********************     1.增加     ************************* |" << endl;
	cout << "| **********************     2.删除     ************************* |" << endl;
	cout << "| **********************     3.查询     ************************* |" << endl;
	cout << "| **********************     4.修改     ************************* |" << endl;
	cout << "| **********************     5.显示     ************************* |" << endl;
	cout << "| **********************     6.排序     ************************* |" << endl;
	cout << "| **********************     7.清空     ************************* |" << endl;
	cout << "| **********************     0.退出     ************************* |" << endl;
	cout << "| *************************************************************** |" << endl;
	cout << "| *************************************************************** |" << endl;
	cout << "|_________________________________________________________________|" << endl<<endl<<endl;
}

//枚举各项功能
enum
{
	EXIT,
	ADD,
	DEL,
	SEARCH,
	MODIFY,
	SHOW,
	SORT,
	EMPTY
};
int main()
{
	//创建出一个通讯录
	struct Contact con;
	//初始化通讯录传地址（结构体传参传地址效率高，并且要可以修改con）
	InitContact(&con);
	int input = 0;
	do
	{
		cout << "现在，请输入你的需求对应的序号" << endl<<endl;
		menu();
		cin >> input;
		switch (input)
		{
		case ADD:
			AddContact(&con);
			break;
		case DEL:
			DelContact(&con);
			break;
		case SEARCH:
			SearchContact(&con);
			break;
		case MODIFY:
			ModifyContact(&con);
			break;
		case SHOW:
			ShowContact(&con);
			break;
		case SORT:
			SortContact(&con);
			break;
		case EMPTY:
			EmptyContact(&con);
			break;
		case EXIT:
			cout << "----------------------------------------------------------" << endl;
			cout << "|…………………………………………………………………………|" << endl;
			cout << "|…………………  程序退出，感谢使用通讯录  …………………|" << endl;
			cout << "|…………………………………………………………………………|" << endl;
			cout << "|………………        水阔鱼沉，江湖无问        ……………|" << endl;
			cout << "|………………        故人长在，婵娟与共        ……………|" << endl;
			cout << "|…………………………………………………………………………|" << endl;
			cout << "|…………………………………………………………………………|" << endl;
			cout << "----------------------------------------------------------" << endl;
			break;
		default:
			cout << "您的选择有误，请重新选择" << endl;
			break;
		}

	} while (input);
	return 0;
}